app/controllers/recepies_controller.rb

  def index
    @recepies = Recepy.all
---
SELECT "recepies".* FROM "recepies"

  def create
    @recepy = Recepy.new(recepy_params)

    respond_to do |format|
      if @recepy.save
---
INSERT INTO "recepies" ("Title", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "kyufteta"], ["Description", "pitay baba si"], ["created_at", "2019-06-09 19:51:58.605855"], ["updated_at", "2019-06-09 19:51:58.605855"]]

  def update
    respond_to do |format|
      if @recepy.update(recepy_params)
---
UPDATE "recepies" SET "Description" = ?, "updated_at" = ? WHERE "recepies"."id" = ?  [["Description", "aaaaaa"], ["updated_at", "2019-06-09 19:52:49.786498"], ["id", 1]]

  def destroy
    @recepy.destroy
---
DELETE FROM "recepies" WHERE "recepies"."id" = ?  [["id", 2]]

    def set_recepy
      @recepy = Recepy.find(params[:id])
---
SELECT  "recepies".* FROM "recepies" WHERE "recepies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]